In [1]:
import pandas as pd

In [4]:
employee_det=pd.DataFrame({'emp.no.':[1001,1002,1003,1004,1005,1006,1007],
                          'emp.name':['abc','def','ghi','jkl','mnl','opq','rst'],
                          'sal':[2000,2100,2200,2300,2400,2500,2600],
                          'Deptno.':[20,30,10,30,10,20,50]})
employee_det

   emp.no. emp.name   sal  Deptno.
0     1001      abc  2000       20
1     1002      def  2100       30
2     1003      ghi  2200       10
3     1004      jkl  2300       30
4     1005      mnl  2400       10
5     1006      opq  2500       20
6     1007      rst  2600       50

dept=pd.DataFrame